import { TeamsProps } from 'src/services/types';

export const mockTeams: TeamsProps[] = [
  {
    id: '3',
    name: 'Команда ГазИнновации',
    projects: [
      {
        id: '11',
        name: 'Газовый Щит',
      },
    ],
  },
  {
    id: '10',
    name: 'Команда ГазИнтеграция',
    projects: [
      {
        id: '1',
        name: 'Энергопоток',
      },
      {
        id: '19',
        name: 'Сибирская Энергия',
      },
    ],
  },
  {
    id: '7',
    name: 'Команда ГазИнфо',
    projects: [
      {
        id: '8',
        name: 'Магистраль',
      },
      {
        id: '11',
        name: 'Газовый Щит',
      },
      {
        id: '19',
        name: 'Сибирская Энергия',
      },
    ],
  },
  {
    id: '11',
    name: 'Команда ГазПрофи',
    projects: [
      {
        id: '15',
        name: 'Северный Поток',
      },
      {
        id: '17',
        name: 'ЭнергоГлобус',
      },
    ],
  },
  {
    id: '9',
    name: 'Команда ГазСистемы',
    projects: [
      {
        id: '17',
        name: 'ЭнергоГлобус',
      },
    ],
  },
  {
    id: '5',
    name: 'Команда ГазТехнологии',
    projects: [
      {
        id: '13',
        name: 'Арктический Ресурс',
      },
      {
        id: '2',
        name: 'Голубой Пламенный',
      },
    ],
  },
  {
    id: '8',
    name: 'Команда ГазЭволюция',
    projects: [
      {
        id: '10',
        name: 'Турбина',
      },
      {
        id: '15',
        name: 'Северный Поток',
      },
      {
        id: '2',
        name: 'Голубой Пламенный',
      },
    ],
  },
  {
    id: '4',
    name: 'Команда ГазпромПроект',
    projects: [
      {
        id: '11',
        name: 'Газовый Щит',
      },
    ],
  },
  {
    id: '2',
    name: 'Команда ГазпромТех',
    projects: [
      {
        id: '10',
        name: 'Турбина',
      },
    ],
  },
  {
    id: '6',
    name: 'Команда ЭнергияГаз',
    projects: [
      {
        id: '4',
        name: 'Северный Маршрут',
      },
      {
        id: '11',
        name: 'Газовый Щит',
      },
    ],
  },
  {
    id: '1',
    name: 'Структура организации',
    projects: [
      {
        id: '2',
        name: 'Голубой Пламенный',
      },
    ],
  },
];
